# Задача 1 (Создание строки и Базовые методы)
# Напишите программу, которая создает строку text со значением "ПРИВЕТ, МИР!". Затем преобразуйте все символы этой строки к нижнему регистру и выведите результат на экран.

# text = "ПРИВЕТ, МИР!"
# result = text.lower()
# print(result)




# Задача 2 (F-строки)
# У вас есть две переменные:
# product = "яблоко"
# price = 85
# Создайте одну строку с помощью f-строки (f"..." ) в формате: "Цена яблока - 85 руб." и выведите ее на экран.

# message = f"Цена {product} - {price} руб."
# print(message)




# Задача 3 (Конкатенация строк)
# Вам даны три переменные:
# part1 = "Автоматизация "
# part2 = "тестирования "
# part3 = "на Python"
# Создайте одну новую строку путем сложения (конкатенации) этих трех переменных в правильном порядке и выведите полученную фразу на экран.

# text = part1 + part2 + part3
# print(text)




# Задача 4 (Срезы)
# Дана строка: alphabet = "abcdefghijklmnopqrstuvwxyz"
# С помощью среза ([:]) получите из нее и выведите на экран строку, содержащую первые 5 букв английского алфавита ("abcde").

# srez = alphabet[0:5]
# print(srez)




# Задача 5 (Получение длины строки)
# Дана строка: sentence = "Сколько символов в этой строке?"
# Напишите код, который вычисляет и выводит на экран длину (количество символов) этой строки.

# len_of_string = len(sentence)
# print(len_of_string)




# Задача 6 (Доступ к символам)
# Дана строка: word = "Питон"
# Напишите код, который выводит на экран третий символ (считая с нуля) из этой строки.

# third_symbol = word[3]
# print(third_symbol)




# Задача 7 (Базовые методы строк)
# Дана строка: messy_string = " я изучаю python "
# Напишите код, который удалит все пробелы в начале и в конце этой строки и выведет результат на экран.

# trimmed_text = messy_string.strip()
# print(trimmed_text)




# Задача 8 (Срезы)
# Дана та же строка с алфавитом: alphabet = "abcdefghijklmnopqrstuvwxyz"
# С помощью среза получите из нее и выведите на экран строку, содержащую последние 3 буквы ("xyz").
#
# srez = alphabet[-3:]
# print(srez)